src/cf/InformationRegisters/СвязиЗначенийСвойствИОбъектовИнтегрированныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СвязиЗначенийСвойствИОбъектовИнтегрированныхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектовИерархия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнтегрированнойСистемы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтегрированныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязиЗначенийСвойствИОбъектовИнтегрированныхСистем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает связь внешнего объекта и значения свойства в привилегированном режиме.
//
// Параметры:
//   ИДВнешнегоОбъекта - Строка - идентификатор объекта ИС.
//   ТипВнешнегоОбъекта - Строка - тип объекта ИС, например, "Справочник.Склады".
//   ВладелецСвойства - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - доп. свойство.
//   ЗначениеСвойства - СправочникСсылка.ЗначенияСвойствОбъектов
//                    - СправочникСсылка.ЗначенияСвойствОбъектовИерархия - значение свойства.
//
Процедура ЗаписатьСвязь(ИДВнешнегоОбъекта, ТипВнешнегоОбъекта, ВладелецСвойства, ЗначениеСвойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.УзелИнтегрированнойСистемы = ПараметрыСеанса.УзелИнтегрированнойСистемы;
	Запись.ИДВнешнегоОбъекта = ИДВнешнегоОбъекта;
	Запись.ТипВнешнегоОбъекта = ТипВнешнегоОбъекта;
	Запись.ВладелецСвойства = ВладелецСвойства;
	Запись.ЗначениеСвойства = ЗначениеСвойства;
	
	Запись.Записать();
	
КонецПроцедуры

// Получает значение свойства для указанного внешнего объекта.
//
// Параметры:
//   ИДВнешнегоОбъекта - Строка - идентификатор объекта ИС.
//   ТипВнешнегоОбъекта - Строка - тип объекта ИС, например, "Справочник.Склады".
//   ВладелецСвойства - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - доп. свойство.
//
// Возвращаемое значение:
//   СправочникСсылка.ЗначенияСвойствОбъектов
//   СправочникСсылка.ЗначенияСвойствОбъектовИерархия - значение свойства, если связь есть, или
//   Неопределено.
//
Функция ПолучитьЗначениеСвойства(ИДВнешнегоОбъекта, ТипВнешнегоОбъекта, ВладелецСвойства) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.УзелИнтегрированнойСистемы = ПараметрыСеанса.УзелИнтегрированнойСистемы;
	Запись.ИДВнешнегоОбъекта = ИДВнешнегоОбъекта;
	Запись.ТипВнешнегоОбъекта = ТипВнешнегоОбъекта;
	Запись.ВладелецСвойства = ВладелецСвойства;
	
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ЗначениеСвойства;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
